---
kind: method
id: M:Autodesk.Revit.DB.StructuralAsset.Copy
zh: 复制
source: html/2256aef6-2b03-709d-88f5-b8f5d858a33d.htm
---
# Autodesk.Revit.DB.StructuralAsset.Copy Method

**中文**: 复制

Produces a copy of the asset.

## Syntax (C#)
```csharp
public StructuralAsset Copy()
```

## Returns
A copy of the asset.